### Task 1 - Installing and Importing Modules (Pandas)

##### 1. Write a command to install the pandas library in your environment.

Note: It’s important to install pandas because it provides data structures and data analysis tools for the Python programming language.

Python raw would not need the % or !
Depending on the verison of Jupyter Notebook a % or ! will be needed

In [1]:
%pip install pandas

Requirement already satisfied: pandas in /opt/anaconda3/lib/python3.11/site-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.23.2 in /opt/anaconda3/lib/python3.11/site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/anaconda3/lib/python3.11/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/anaconda3/lib/python3.11/site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in /opt/anaconda3/lib/python3.11/site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

##### 2. Write a command to install a specific version (2.1.1) of pandas.

Note: Sometimes, you might need to work with a specific version of pandas due to compatibility issues with other libraries or specific features available in that version

##### 3. Write a command to import the pandas library as ‘pd’.

Note: It’s a common convention to import pandas as pd. This makes your code shorter and more readable.

In [3]:
import pandas as pd

##### 4. Write a command to create a pandas Series named ‘fruits’ with the values [‘apple’, ‘banana’, ‘cherry’].

Note: A Series is a one-dimensional labeled array capable of holding any data type. It is one of the basic structures in pandas.

In [1]:
import pandas as pd 
fruits = ["apple", "banana", "cherry"]

fruit_df = pd.Series(fruits)

print(fruit_df)

0     apple
1    banana
2    cherry
dtype: object

##### 5. Create a DataFrame named ‘purchases’ with two columns ‘apples’ and ‘oranges’.

```
The ‘apples’ column should have the values [3, 2, 0, 1] and the ‘oranges’ column should have the values [0, 3, 7, 2].
```

Note: DataFrames are two-dimensional size-mutable, potentially heterogeneous tabular data structures with labeled axes (rows and columns). They are one of the fundamental structures in pandas.

In [3]:
import pandas as pd 

purchases  = {
    "apples" : [3, 2, 0, 1],
    "oranges" : [0, 3, 7, 2]} 

purchases_df= pd.DataFrame(purchases)

### Task 2 - Data Loading in Pandas

##### 1. Write a line of code to open the ‘employees.csv’ data file into a pandas DataFrame.

```
The employees.csv file will need to be in the same directory(folder) as the notebook, or the filepath will need to be added.
```

Note: This function is useful for loading CSV data into a pandas DataFrame, which is a two-dimensional labeled data structure with columns of potentially different types. It’s one of the most common initial steps in data analysis.

In [8]:
import pandas as pd

employees_df = pd.read_csv("employees.csv")

##### 2. Write a line of code to display the first 5 rows of the DataFrame.

Note: The .head(n) function is useful for quickly previewing the first n rows of your DataFrame, which can help you get a sense of your data at a glance.

In [9]:
employees_df.head()

,Name,Age,City,Salary,Gender,column1,State,Start Date,DateOfBirth
0,kyle,59.0,indianapolis,151000.0,Other,Raymond,Indiana,1990-12-09,1964-10-15 14:21:44.568274
1,Luis,31.0,Los Angeles,58000.0,NaN,Andrade,CA,1992-02-24,1992-10-08 14:21:44.568274
2,katherine,46.0,Naperville,146000.0,female,Gutierrez,IL,21-12-2015,1977-10-12 14:21:44.568274
3,robert,25.0,pittsburgh,66000.0,Male,Yates,Pennsylvania,1993-01-25,1998-10-07 14:21:44.568274
4,austin,49.0,Naperville,96000.0,NaN,Turner,IL,20-09-1979,1974-10-13 14:21:44.568274

##### 3. Write a line of code to display the last 3 rows of the DataFrame.

Note: The .tail(n) function is useful for quickly viewing the last n rows of your DataFrame. This can be particularly helpful when you want to see the most recent entries in a time-series dataset.

In [10]:
employees_df.tail(3)

,Name,Age,City,Salary,Gender,column1,State,Start Date,DateOfBirth
157,Laura,28.0,Pittsburgh,53000.0,male,Jackson,Pennsylvania,1991-05-05,1995-10-08 14:21:44.568274
158,kiara,54.0,Tampa,33000.0,NaN,Hernandez,Florida,03-01-1985,1969-10-14 14:21:44.568274
159,Jennifer,38.0,san francisco,58000.0,NaN,Palmer,CA,2017-01-31,1985-10-10 14:21:44.568274

##### 4. Write a line of code to randomly select 7 rows from the DataFrame.

Note: The .sample(n) function is useful when you want to randomly select n rows from your DataFrame. This can be helpful for creating random samples from your data for tasks like bootstrapping or cross-validation.

In [11]:
employees_df.sample(7)

,Name,Age,City,Salary,Gender,column1,State,Start Date,DateOfBirth
91,nicole,52.0,Jacksonville,102000.0,female,Patterson,Florida,1986-11-04,1971-10-14 14:21:44.568274
50,Laura,28.0,Pittsburgh,53000.0,male,Jackson,Pennsylvania,1991-05-05,1995-10-08 14:21:44.568274
24,richard,28.0,Pittsburgh,77000.0,other,Vance,Pennsylvania,2017-10-19,1995-10-08 14:21:44.568274
116,hayley,51.0,houston,84000.0,male,Bowman,TX,2017-10-19,1972-10-13 14:21:44.568274
136,hunter,49.0,san diego,29000.0,male,Mason,CA,2014-05-10,2022-10-17 14:21:44.568274
119,Annette,21.0,houston,122000.0,NaN,Johnson,TX,1999-05-26,2023-01-20 14:21:44.568274
158,kiara,54.0,Tampa,33000.0,NaN,Hernandez,Florida,03-01-1985,1969-10-14 14:21:44.568274

##### 5. Write a line of code to save the DataFrame back to a new CSV file named ‘new_employees.csv’.

```
df.to_csv('new_employees.csv', index=False)
```

index=False tells the function not to write the row index to file.

Note: The .to_csv() function is useful for saving your DataFrame back to a CSV file. This is often used after you’ve made some modifications to your data and want to save the results for later use.

In [12]:
employees_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 160 entries, 0 to 159
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         160 non-null    object
 1   Age          159 non-null    float64
 2   City         156 non-null    object
 3   Salary       159 non-null    float64
 4   Gender       118 non-null    object
 5   column1      158 non-null    object
 6   State        156 non-null    object
 7   Start Date   158 non-null    object
 8   DateOfBirth  160 non-null    object
dtypes: float64(2), object(7)
memory usage: 11.4+ KB

##### 6. Write a line of code to open a CSV file named ‘separator.csv’ that uses a semicolon (;) as the separator.

Note: In CSV files, a separator (also known as a delimiter) is used to distinguish between different fields.

The most common separator is a comma, but other characters can be used as well, such as semicolons, tabs (\t), spaces, etc.

The choice of separator can depend on the data itself (for example, if the data contains commas within fields, a different separator might be used).

When reading a CSV file with pandas, you can specify the separator using the sep parameter in the read_csv function.

If not specified, pandas will assume the separator is a comma.

It’s important to know what separator is used in your data file to correctly load it into a DataFrame.

In [13]:
import pandas as pd 

separator_df = pd.read_csv('separator.csv', sep=';')

print(separator_df)

separator_df.shape

            Name   Age             City    Salary    Gender      column1  \
0          kyle   59.0    indianapolis   151000.0    Other      Raymond
1          Luis   31.0     Los Angeles    58000.0       NaN     Andrade
2     katherine   46.0      Naperville   146000.0   female    Gutierrez
3        robert   25.0      pittsburgh    66000.0     Male        Yates
4        austin   49.0      Naperville    96000.0       NaN      Turner
..           ...   ...              ...       ...       ...          ...
155    Jennifer   38.0   san francisco    58000.0       NaN      Palmer
156        Sean   35.0     Los Angeles    70000.0     Male       Harris
157       Laura   28.0      Pittsburgh    53000.0     male      Jackson
158       kiara   54.0           Tampa    33000.0       NaN   Hernandez
159    Jennifer   38.0   san francisco    58000.0       NaN      Palmer

              State    Start Date DateOfBirth
0          Indiana     1990-12-09  1964-10-15
1               CA     1992-02-24  1992-10-08
2               IL    21-12-2015   1977-10-12
3     Pennsylvania     1993-01-25  1998-10-07
4               IL    20-09-1979   1974-10-13
..              ...           ...         ...
155             CA     2017-01-31  1985-10-10
156             CA     2011-07-06  1988-10-09
157   Pennsylvania     1991-05-05  1995-10-08
158        Florida    03-01-1985   1969-10-14
159             CA     2017-01-31  1985-10-10

[160 rows x 9 columns]

(160, 9)

##### 7. Write a line of code to get the shape of the DataFrame.

Note: The .shape attribute is useful for quickly finding out how many rows and columns are in your DataFrame. It returns a tuple in the format (rows, columns).

In [14]:
import pandas as pd

separator_df.shape

(160, 9)

##### 8. Write a line of code to get a summary of the DataFrame’s numerical columns.

Note: The .describe() function is useful for quickly generating descriptive statistics that summarize the central tendency, dispersion, and shape of a dataset’s distribution. It automatically excludes NaN values.

In [15]:
import pandas as pd

separator_df.describe()

              Age         Salary
count  159.000000     159.000000
mean    40.773585   86503.144654
std     11.125250   40741.835280
min     20.000000   23000.000000
25%     32.000000   54000.000000
50%     41.000000   77000.000000
75%     50.000000  115000.000000
max     59.000000  191000.000000

##### 9. Write a line of code to get a concise summary of the DataFrame.

Note: The .info() function is useful for getting a quick description of the data, especially the total number of non-null observations and the data type of each column.

In [16]:
employees_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 160 entries, 0 to 159
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         160 non-null    object
 1   Age          159 non-null    float64
 2   City         156 non-null    object
 3   Salary       159 non-null    float64
 4   Gender       118 non-null    object
 5   column1      158 non-null    object
 6   State        156 non-null    object
 7   Start Date   158 non-null    object
 8   DateOfBirth  160 non-null    object
dtypes: float64(2), object(7)
memory usage: 11.4+ KB

##### 10. Write a line of code to get the number of unique values in each column.

Note: The .nunique() function is useful for understanding the number of distinct values in each column. This can help identify columns with high cardinality.

In [17]:
employees_df.nunique()

Name           129
Age             40
City            46
Salary          91
Gender           7
column1        126
State            9
Start Date      30
DateOfBirth     49
dtype: int64

##### 11. Write a line of code to select all data from the ‘Age’ column.

Note: Selecting a single column from your DataFrame is useful when you want to analyze or manipulate that specific column of data.

In [19]:
print(employees_df["Age"])

0      59.0
1      31.0
2      46.0
3      25.0
4      49.0
       ...
155    38.0
156    35.0
157    28.0
158    54.0
159    38.0
Name: Age, Length: 160, dtype: float64

##### 12.  Write a line of code to calculate the mean age.

Note: The .mode() function is used to find the most frequently occurring value(s) in a series. This can be useful when analyzing categorical data or certain types of numerical data.

In [20]:
employees_df["Age"].mean()

40.77358490566038

##### 13. Write a line of code to find the median salary.

Note: The .median() function is used to find the middle value in a series when it’s sorted in ascending order. This can be more informative than the mean for datasets with skewed distributions or outliers.

In [21]:
employees_df["Salary"].median()

77000.0

### Task 3: Data Cleaning in Pandas

##### 1. Write a line of code to drop the ‘column1’ from the DataFrame.

Note: The .drop() function is useful for removing rows or columns by label names and corresponding axis, or by specifying directly index or column names.

In [29]:
employees_df.drop("column1",axis= 1)

,Name,Age,City,Salary,Gender,State,Start Date,DateOfBirth
0,kyle,59.0,indianapolis,151000.0,Other,Indiana,1990-12-09,1964-10-15 14:21:44.568274
1,Luis,31.0,Los Angeles,58000.0,NaN,CA,1992-02-24,1992-10-08 14:21:44.568274
2,katherine,46.0,Naperville,146000.0,female,IL,21-12-2015,1977-10-12 14:21:44.568274
3,robert,25.0,pittsburgh,66000.0,Male,Pennsylvania,1993-01-25,1998-10-07 14:21:44.568274
4,austin,49.0,Naperville,96000.0,NaN,IL,20-09-1979,1974-10-13 14:21:44.568274
...,...,...,...,...,...,...,...,...
155,Jennifer,38.0,san francisco,58000.0,NaN,CA,2017-01-31,1985-10-10 14:21:44.568274
156,Sean,35.0,Los Angeles,70000.0,Male,CA,2011-07-06,1988-10-09 14:21:44.568274
157,Laura,28.0,Pittsburgh,53000.0,male,Pennsylvania,1991-05-05,1995-10-08 14:21:44.568274
158,kiara,54.0,Tampa,33000.0,NaN,Florida,03-01-1985,1969-10-14 14:21:44.568274
159,Jennifer,38.0,san francisco,58000.0,NaN,CA,2017-01-31,1985-10-10 14:21:44.568274

##### 2. Write a line of code to fill missing values in the ‘Age’ column with the average age.

```
This demonstrates the function of the mean function and utlises imputation, but does it make sense to create an Employees age from a Mean? In this situation it would be better to request a real age for an employee from the data source, or remove that emplyee if it is histroical data.
```

Note: The .fillna() function is used to fill NA/NaN values using the specified method which can be a constant or a DataFrame method like mean, median etc.

In [23]:
import pandas as pd 

employees_df['Age'].fillna(employees_df['Age'].median(), inplace=True)

##### 3. Write a line of code to drop rows with any missing values.

Note: The .dropna() function is used to remove missing values. It’s useful when you want to discard any incomplete data.

In [62]:
employees_df.dropna(inplace=True)

##### 4. Write a line of code to find duplicated rows.

Note: The .duplicated() function returns a Boolean Series denoting duplicate rows. It’s useful when you want to identify any repeated data in your DataFrame.

In [64]:
employees_df.duplicated()

0      False
2      False
3      False
5      False
6      False
       ...
151     True
153     True
154     True
156     True
157     True
Length: 114, dtype: bool

##### 5. Write a line of code to drop duplicated rows.

Note: The .drop_duplicates() function is used to remove duplicate rows. This is often necessary in data cleaning process to get rid of repeated information.

In [66]:
employees_df.drop_duplicates(inplace=True)

print(employees_df.head())

            Name   Age            City    Salary    Gender           State  \
0          kyle   59.0   indianapolis   151000.0    Other         Indiana
2     katherine   46.0     Naperville   146000.0   female              IL
3        robert   25.0     pittsburgh    66000.0     Male    Pennsylvania
5   christopher   48.0        Buffalo    47000.0    other              NY
6      michelle   45.0     Fort Wayne    61000.0     Male         Indiana

     Start Date                 DateOfBirth
0    1990-12-09  1964-10-15 14:21:44.568274
2   21-12-2015   1977-10-12 14:21:44.568274
3    1993-01-25  1998-10-07 14:21:44.568274
5    1990-12-09  1975-10-13 14:21:44.568274
6    1991-05-05  1978-10-12 14:21:44.568274

6. Write a line of code to replace ‘Illinois’ with ‘IL’ in the ‘State’ column.

Note: The .str.replace() function is used to replace a specified phrase with another specified phrase. It’s useful when you want to standardize the data in your DataFrame.

In [30]:
import pandas as pd 

employees_df["State"].str.replace( "Illinois","IL")

0            Indiana
1                 CA
2                 IL
3       Pennsylvania
4                 IL
            ...
155               CA
156               CA
157     Pennsylvania
158          Florida
159               CA
Name: State, Length: 160, dtype: object

##### 7. Write a line of code to find all rows where ‘City’ contains ‘naperville’.

Note: The .str.contains() function is used to test if pattern or regex is contained within a string of a Series or Index. It’s useful when you want to filter your data based on certain text criteria.

In [31]:
employees_df["City"].str.contains("naperville")

0      False
1      False
2      False
3      False
4      False
       ...
155    False
156    False
157    False
158    False
159    False
Name: City, Length: 160, dtype: object

##### 8. Write a line of code to standardize the ‘City’ and ‘State’ columns in the DataFrame. For ‘City’, replace ‘naperville’ with ‘Naperville’, and for ‘State’, replace ‘Illinois’ with ‘IL’.

Note: The .str.replace() function is used to replace a specified phrase with another specified phrase. It’s useful when you want to standardise the data in your DataFrame. In this case, we’re using it to ensure that city and state names follow a consistent format. This is an important step in data cleaning, especially when dealing with text data, as it ensures that the same entity is represented in the same way across the dataset.

In [32]:
employees_df.replace({"City":{"naperville":"Naperville"},"State":{"Illinois":"IL"}})

,Name,Age,City,Salary,Gender,column1,State,Start Date,DateOfBirth
0,kyle,59.0,indianapolis,151000.0,Other,Raymond,Indiana,1990-12-09,1964-10-15 14:21:44.568274
1,Luis,31.0,Los Angeles,58000.0,NaN,Andrade,CA,1992-02-24,1992-10-08 14:21:44.568274
2,katherine,46.0,Naperville,146000.0,female,Gutierrez,IL,21-12-2015,1977-10-12 14:21:44.568274
3,robert,25.0,pittsburgh,66000.0,Male,Yates,Pennsylvania,1993-01-25,1998-10-07 14:21:44.568274
4,austin,49.0,Naperville,96000.0,NaN,Turner,IL,20-09-1979,1974-10-13 14:21:44.568274
...,...,...,...,...,...,...,...,...,...
155,Jennifer,38.0,san francisco,58000.0,NaN,Palmer,CA,2017-01-31,1985-10-10 14:21:44.568274
156,Sean,35.0,Los Angeles,70000.0,Male,Harris,CA,2011-07-06,1988-10-09 14:21:44.568274
157,Laura,28.0,Pittsburgh,53000.0,male,Jackson,Pennsylvania,1991-05-05,1995-10-08 14:21:44.568274
158,kiara,54.0,Tampa,33000.0,NaN,Hernandez,Florida,03-01-1985,1969-10-14 14:21:44.568274
159,Jennifer,38.0,san francisco,58000.0,NaN,Palmer,CA,2017-01-31,1985-10-10 14:21:44.568274

##### 9. (OPTIONAL) Write a line of code to standardize the ‘City’ and ‘State’ columns in the DataFrame.

Advanced Question. Will go into more in next lesson so do not worry if you cannot complete this one now.

```
Reload employees.csv in and output solution to a DataFrame named 'city_state_corrected_df'

Any Unknown city or states should be filled with an 'Unknown' string.

Run the first code block to create mapping dictionaries for States and City. You can choose to use these or manually type out each state and city and what they should be
```

In [ ]:
# City to State mapping
city_state = {
    'New York': 'New York',
    'Buffalo': 'New York',
    'Rochester': 'New York',
    'Los Angeles': 'California',
    'San Francisco': 'California',
    'San Diego': 'California',
    'Houston': 'Texas',
    'San Antonio': 'Texas',
    'Dallas': 'Texas',
    'Jacksonville': 'Florida',
    'Miami': 'Florida',
    'Tampa': 'Florida',
    'Chicago': 'Illinois',
    'Aurora': 'Illinois',
    'Naperville': 'Illinois',
    'Philadelphia': 'Pennsylvania',
    'Pittsburgh': 'Pennsylvania',
    'Allentown': 'Pennsylvania',
    'Phoenix': 'Arizona',
    'Tucson': 'Arizona',
    'Mesa': 'Arizona',
    'Indianapolis': 'Indiana',
    'Fort Wayne': 'Indiana',
    'Evansville': 'Indiana'
}

# Abbreviations for some states
state_abbr = {
    'New York': 'NY',
    'California': 'CA',
    'Texas': 'TX',
    'Florida': 'FL',
    'Illinois': 'IL',
    'Pennsylvania': 'PA',
    'Arizona': 'AZ',
    'Indiana': 'IN'
}

In [192]:
print(employees_df.sample(7))

           Name   Age             City    Salary   Gender      column1  \
127   JENNIFER   38.0   san francisco    58000.0  unknown      Palmer
118              43.0    indianapolis    68000.0    other      Nelson
55       COLIN   31.0       allentown    92000.0    other     Solomon
101        AMY   53.0         phoenix    29000.0    other     Mendoza
14       SUSAN   56.0           tampa    55000.0     male      Morgan
4       AUSTIN   49.0      Naperville    96000.0  unknown      Turner
91      NICOLE   52.0    Jacksonville   102000.0   female   Patterson

              State    Start Date                 DateOfBirth
127             CA     2017-01-31  1985-10-10 14:21:44.568274
118        Indiana     1988-07-08  1980-10-11 14:21:44.568274
55    Pennsylvania     1988-07-08  1992-10-08 14:21:44.568274
101             AZ     2013-04-23  1970-10-14 14:21:44.568274
14         Florida    19-04-2022   1967-10-15 14:21:44.568274
4               IL    20-09-1979   1974-10-13 14:21:44.568274
91         Florida     1986-11-04  1971-10-14 14:21:44.568274

In [229]:
# read_csv the employees.csv into the correctly named DataFrame here
import pandas as pd
import numpy as np

# Read employees.csv into the correctly named DataFrame here
city_state_corrected_df = pd.read_csv('employees.csv')


city_state_corrected_df["City"] = city_state_corrected_df["City"].astype(str).str.strip()
city_state_corrected_df["State"] = city_state_corrected_df["State"].astype(str).str.strip()


city_state_corrected_df["City"] = city_state_corrected_df["City"].str.capitalize()
city_state_corrected_df["State"] = city_state_corrected_df["State"].str.upper()

city_state_corrected_df["State"].replace({"NY": "New York", "CA": "California", "TX": "Texas", "FL": "Florida", "IL": "Illinois", "PA": "Pennsylvania", "AZ": "Arizona", "IN": "Indiana"}, inplace=True)

city_state_corrected_df["State"] = city_state_corrected_df["State"].str.capitalize()

state_categories = ["New York", "California", "Texas", "Florida", "Illinois", 'Pennsylvania', 'Arizona', 'Indiana']


New_York = "Buffalo|New York|Rochester"
California = "Los Angeles|San Francisco|San Diego"
Texas = "Houston|San Antonio|Dallas"
Florida = "Jacksonville|Miami|Tampa"
Illinois = "Chicago|Aurora|Naperville"
Pennsylvania = "Philadelphia|Pittsburgh|Allentown"
Arizona = "Phoenix|Tucson|Mesa"
Indiana = "Indianapolis|Fort Wayne|Evansville"



conditions = [
    (city_state_corrected_df["City"].str.contains(New_York,case=False)),
    (city_state_corrected_df["City"].str.contains(California,case=False)),
    (city_state_corrected_df["City"].str.contains(Texas,case=False)),
    (city_state_corrected_df["City"].str.contains(Florida,case=False)),
    (city_state_corrected_df["City"].str.contains(Illinois,case=False)),
    (city_state_corrected_df["City"].str.contains(Pennsylvania,case=False)),
    (city_state_corrected_df["City"].str.contains(Arizona,case=False)),
    (city_state_corrected_df["City"].str.contains(Indiana,case=False)),
]

city_state_corrected_df["State"] = np.select(conditions, state_categories, default="Unknown")

print(city_state_corrected_df.head())

city_state_corrected_df["State"].unique()

          Name   Age          City    Salary    Gender      column1  \
0        kyle   59.0  Indianapolis  151000.0    Other      Raymond
1        Luis   31.0   Los angeles   58000.0       NaN     Andrade
2   katherine   46.0    Naperville  146000.0   female    Gutierrez
3      robert   25.0    Pittsburgh   66000.0     Male        Yates
4      austin   49.0    Naperville   96000.0       NaN      Turner

          State    Start Date                 DateOfBirth
0       Indiana    1990-12-09  1964-10-15 14:21:44.568274
1    California    1992-02-24  1992-10-08 14:21:44.568274
2      Illinois   21-12-2015   1977-10-12 14:21:44.568274
3  Pennsylvania    1993-01-25  1998-10-07 14:21:44.568274
4      Illinois   20-09-1979   1974-10-13 14:21:44.568274

array(['Indiana', 'California', 'Illinois', 'Pennsylvania', 'New York',
       'Florida', 'Texas', 'Arizona', 'Unknown'], dtype=object)

##### 10. (OPTIONAL) Perform Data Cleaning on the Gender Column.

### Task 4: Data Manipulation

In [230]:
employees_df["Gender"] = employees_df["Gender"].astype(str)
employees_df["Gender"] = employees_df["Gender"].str.lower().str.strip()
employees_df["Gender"].fillna("Unknown", inplace=True)
employees_df.drop_duplicates(inplace=True)

employees_df["Gender"].replace({"^other": "unknown", "Other": "unknown", " ":"unknown","nan":"unknown"}, inplace=True) 
employees_df = employees_df.dropna(subset=["Gender"])
print(employees_df["Gender"].unique())

['other' 'unknown' 'female' 'male']

In [226]:
import pandas as pd
import numpy as np

# Read employees.csv into the correctly named DataFrame
city_state_corrected_df = pd.read_csv('employees.csv')

city_state_corrected_df["City"] = city_state_corrected_df["City"].astype(str).str.strip()
city_state_corrected_df["State"] = city_state_corrected_df["State"].astype(str).str.strip()

# Capitalize the values in "City" and "State" columns
city_state_corrected_df["City"] = city_state_corrected_df["City"].str.capitalize()
city_state_corrected_df["State"] = city_state_corrected_df["State"].str.capitalize()

# Replace state abbreviations with full state names
state_mapping = {"NY": "New York", "CA": "California", "TX": "Texas", "FL": "Florida", "IL": "Illinois",
                 "PA": "Pennsylvania", "AZ": "Arizona", "IN": "Indiana"}
city_state_corrected_df["State"].replace(state_mapping, inplace=True)

# Define cities for each state
cities_by_state = {
    "New York": "Buffalo|New York|Rochester",
    "California": "Los Angeles|San Francisco|San Diego",
    "Texas": "Houston|San Antonio|Dallas",
    "Florida": "Jacksonville|Miami|Tampa",
    "Illinois": "Chicago|Aurora|Naperville",
    "Pennsylvania": "Philadelphia|Pittsburgh|Allentown",
    "Arizona": "Phoenix|Tucson|Mesa",
    "Indiana": "Indianapolis|Fort Wayne|Evansville"
}

# Define state categories
state_categories = ["New York", "California", "Texas", "Florida", "Illinois", 'Pennsylvania', 'Arizona', 'Indiana']

# Map cities to corresponding states and assign state categories
conditions = [
    city_state_corrected_df["City"].str.contains(cities, case=False) for cities in cities_by_state.values()
]
city_state_corrected_df["State"] = np.select(conditions, state_categories, default="Unknown")

print(city_state_corrected_df.head())

          Name   Age          City    Salary    Gender      column1  \
0        kyle   59.0  Indianapolis  151000.0    Other      Raymond
1        Luis   31.0   Los angeles   58000.0       NaN     Andrade
2   katherine   46.0    Naperville  146000.0   female    Gutierrez
3      robert   25.0    Pittsburgh   66000.0     Male        Yates
4      austin   49.0    Naperville   96000.0       NaN      Turner

          State    Start Date                 DateOfBirth
0       Indiana    1990-12-09  1964-10-15 14:21:44.568274
1    California    1992-02-24  1992-10-08 14:21:44.568274
2      Illinois   21-12-2015   1977-10-12 14:21:44.568274
3  Pennsylvania    1993-01-25  1998-10-07 14:21:44.568274
4      Illinois   20-09-1979   1974-10-13 14:21:44.568274

##### 1. Write a line of code to apply a function that adds 10 to each value in the ‘Age’ column

```
A lambda function would make the code more readable here.
```

Note: The .apply() function is useful for applying a function along an axis of the DataFrame. It can be used with a lambda function, as in this case, to perform operations on each element in a column.

In [66]:
employees_df["Age"].apply(lambda x: x + 10 )

0      69.0
1      41.0
2      56.0
3      35.0
4      59.0
       ...
155    48.0
156    45.0
157    38.0
158    64.0
159    48.0
Name: Age, Length: 160, dtype: float64

##### 2. Write a line of code to apply a function that converts all names in the ‘Name’ column to uppercase.

Note: The .apply() function can be used with string methods to perform operations on each string in a column, e.g. .upper().

In [70]:
employees_df["Name"]= employees_df["Name"].str.upper()

print(employees_df["Name"])

0            KYLE
1            LUIS
2       KATHERINE
3          ROBERT
4          AUSTIN
          ...
155      JENNIFER
156          SEAN
157         LAURA
158         KIARA
159      JENNIFER
Name: Name, Length: 160, dtype: object

##### 3. Write a line of code to concatenate df and df2 along rows.

```
# Creating a second DataFrame
data2 = {
    'Name': ['John', 'Jane'],
    'Age': [30, 25],
    'City': ['New York', 'Los Angeles'],
    'Salary': [70000, 80000],
    'Gender': ['Male', 'Female'],
    'column1': ['Doe', 'Doe'],
    'State': ['NY', 'CA'],
    'Start Date': ['2010-01-01', '2012-07-01'],
    'DateOfBirth': ['1990-01-01', '1997-07-01']
}
df2 = pd.DataFrame(data2)
```

Note: The pd.concat() function is useful for concatenating two or more pandas objects along a particular axis. By default, it concatenates along rows (i.e., axis=0). This is often used when you want to append rows from one DataFrame to another.

In [72]:
import pandas as pd

# Define the dataframe 1
data = {
    'Name': ['joseph', 'Joshua', 'yvonne', 'nicole', 'Adam'],
    'Age': [44.0, None, 49.0, 27.0, 47.0],
    'City': ['naperville', 'aurora', None, 'Rochester', 'fort wayne'],
    'Salary': [105000.0, 154000.0, 35000.0, 54000.0, 72000.0],
    'Gender': ['other', None, 'Female', 'Other', None],
    'column1': ['Holmes', 'Young', 'Martin', 'Zuniga', 'Ramirez'],
    'State': ['Illinois', 'Illinois', None, 'New York', 'IN'],
    'Start Date': ['2014-10-16', '2002-05-06', '1994', '1999-05-21', '2021-04-10'],
    'DateOfBirth': ['1979-10-12', '2023-05-21', '1974-10-13 00:00:00', '1996-10-07', '1976-10-12']
}

# Convert the dictionary into a DataFrame
df = pd.DataFrame(data)
df

,Name,Age,City,Salary,Gender,column1,State,Start Date,DateOfBirth
0,joseph,44.0,naperville,105000.0,other,Holmes,Illinois,2014-10-16,1979-10-12
1,Joshua,NaN,aurora,154000.0,None,Young,Illinois,2002-05-06,2023-05-21
2,yvonne,49.0,None,35000.0,Female,Martin,None,1994,1974-10-13 00:00:00
3,nicole,27.0,Rochester,54000.0,Other,Zuniga,New York,1999-05-21,1996-10-07
4,Adam,47.0,fort wayne,72000.0,None,Ramirez,IN,2021-04-10,1976-10-12

In [73]:
# Creating a second DataFrame
data2 = {
    'Name': ['John', 'Jane'],
    'Age': [30, 25],
    'City': ['New York', 'Los Angeles'],
    'Salary': [70000, 80000],
    'Gender': ['Male', 'Female'],
    'column1': ['Doe', 'Doe'],
    'State': ['NY', 'CA'],
    'Start Date': ['2010-01-01', '2012-07-01'],
    'DateOfBirth': ['1990-01-01', '1997-07-01']
}
df2 = pd.DataFrame(data2)
df2

,Name,Age,City,Salary,Gender,column1,State,Start Date,DateOfBirth
0,John,30,New York,70000,Male,Doe,NY,2010-01-01,1990-01-01
1,Jane,25,Los Angeles,80000,Female,Doe,CA,2012-07-01,1997-07-01

In [76]:
concat_df = pd.concat([df, df2])

print(concat_df)

     Name   Age         City    Salary  Gender  column1     State  Start Date  \
0  joseph  44.0   naperville  105000.0   other   Holmes  Illinois  2014-10-16
1  Joshua   NaN       aurora  154000.0    None    Young  Illinois  2002-05-06
2  yvonne  49.0         None   35000.0  Female   Martin      None        1994
3  nicole  27.0    Rochester   54000.0   Other   Zuniga  New York  1999-05-21
4    Adam  47.0   fort wayne   72000.0    None  Ramirez        IN  2021-04-10
0    John  30.0     New York   70000.0    Male      Doe        NY  2010-01-01
1    Jane  25.0  Los Angeles   80000.0  Female      Doe        CA  2012-07-01

           DateOfBirth
0           1979-10-12
1           2023-05-21
2  1974-10-13 00:00:00
3           1996-10-07
4           1976-10-12
0           1990-01-01
1           1997-07-01

##### 4. Write a line of code to concatenate df and df2 along columns.

Note: By specifying axis=1 in the pd.concat() function, you can concatenate DataFrames along columns instead of rows. This is useful when you want to add new columns to a DataFrame from another DataFrame with the same index.

In [78]:
concat_df = pd.concat([df, df2], axis = 1)

print(concat_df)

     Name   Age        City    Salary  Gender  column1     State  Start Date  \
0  joseph  44.0  naperville  105000.0   other   Holmes  Illinois  2014-10-16
1  Joshua   NaN      aurora  154000.0    None    Young  Illinois  2002-05-06
2  yvonne  49.0        None   35000.0  Female   Martin      None        1994
3  nicole  27.0   Rochester   54000.0   Other   Zuniga  New York  1999-05-21
4    Adam  47.0  fort wayne   72000.0    None  Ramirez        IN  2021-04-10

           DateOfBirth  Name   Age         City   Salary  Gender column1  \
0           1979-10-12  John  30.0     New York  70000.0    Male     Doe
1           2023-05-21  Jane  25.0  Los Angeles  80000.0  Female     Doe
2  1974-10-13 00:00:00   NaN   NaN          NaN      NaN     NaN     NaN
3           1996-10-07   NaN   NaN          NaN      NaN     NaN     NaN
4           1976-10-12   NaN   NaN          NaN      NaN     NaN     NaN

  State  Start Date DateOfBirth
0    NY  2010-01-01  1990-01-01
1    CA  2012-07-01  1997-07-01
2   NaN         NaN         NaN
3   NaN         NaN         NaN
4   NaN         NaN         NaN

##### 5. Write a line of code to concatenate df and df2, and ignore the original index.

Note: The ignore_index=True parameter in the pd.concat() function is useful when you want to ignore the original index and reset it in the resulting DataFrame. This is often used when the index does not contain any meaningful information.

In [80]:
concat_df = pd.concat([df, df2], axis = 1, ignore_index= True)

print(concat_df)

       0     1           2         3       4        5         6           7   \
0  joseph  44.0  naperville  105000.0   other   Holmes  Illinois  2014-10-16
1  Joshua   NaN      aurora  154000.0    None    Young  Illinois  2002-05-06
2  yvonne  49.0        None   35000.0  Female   Martin      None        1994
3  nicole  27.0   Rochester   54000.0   Other   Zuniga  New York  1999-05-21
4    Adam  47.0  fort wayne   72000.0    None  Ramirez        IN  2021-04-10

                    8     9     10           11       12      13   14   15  \
0           1979-10-12  John  30.0     New York  70000.0    Male  Doe   NY
1           2023-05-21  Jane  25.0  Los Angeles  80000.0  Female  Doe   CA
2  1974-10-13 00:00:00   NaN   NaN          NaN      NaN     NaN  NaN  NaN
3           1996-10-07   NaN   NaN          NaN      NaN     NaN  NaN  NaN
4           1976-10-12   NaN   NaN          NaN      NaN     NaN  NaN  NaN

           16          17
0  2010-01-01  1990-01-01
1  2012-07-01  1997-07-01
2         NaN         NaN
3         NaN         NaN
4         NaN         NaN

### Task 5 (Homework): Joins

In [104]:
import pandas as pd

# Create dataframes function

def create_joins_df():
    # Creating DataFrame df1
    data1 = {
        'ID': list(range(1, 21)),
        'Name': ['Employee'+str(i) for i in range(1, 21)],
        'Department': ['Sales', 'Marketing', 'HR', 'Sales', 'IT', 'Marketing', 'HR', 'IT', 'Sales', 'Marketing',
                    'HR', 'IT', 'Sales', 'Marketing', 'HR', 'IT', 'Sales', 'Marketing', 'HR', 'IT'],
        'Start_Date': pd.date_range(start='01-01-2020', periods=20),
        'Salary': [i*1000 for i in range(50, 70)]
    }
    df1 = pd.DataFrame(data1)

    # Creating DataFrame df2
    data2 = {
        'Identifier': list(range(11, 31)),
        'Role': ['Role'+str(i) for i in range(11, 31)],
        'Years_of_Experience': [i for i in range(1, 21)]
    }
    df2 = pd.DataFrame(data2)

    return df1, df2

# Run DataFrame creation function
df1, df2 = create_joins_df()
df2.head(5)
df1.head(5)

   ID       Name Department Start_Date  Salary
0   1  Employee1      Sales 2020-01-01   50000
1   2  Employee2  Marketing 2020-01-02   51000
2   3  Employee3         HR 2020-01-03   52000
3   4  Employee4      Sales 2020-01-04   53000
4   5  Employee5         IT 2020-01-05   54000

##### 1. Write a line of code to perform an inner join of df1 and df2 on the ‘ID’ column.

Note: The merge() function with how='inner' is useful for combining two DataFrames based on a common column, and only keeping rows that have matching values in both DataFrames.

In [134]:
# Run DataFrame creation function
inner_join_df = pd.merge(df1, df2, left_on='ID', right_on='Identifier', how='inner')

print(inner_join_df)

   ID        Name Department Start_Date  Salary  Identifier    Role  \
0  11  Employee11         HR 2020-01-11   60000          11  Role11
1  12  Employee12         IT 2020-01-12   61000          12  Role12
2  13  Employee13      Sales 2020-01-13   62000          13  Role13
3  14  Employee14  Marketing 2020-01-14   63000          14  Role14
4  15  Employee15         HR 2020-01-15   64000          15  Role15
5  16  Employee16         IT 2020-01-16   65000          16  Role16
6  17  Employee17      Sales 2020-01-17   66000          17  Role17
7  18  Employee18  Marketing 2020-01-18   67000          18  Role18
8  19  Employee19         HR 2020-01-19   68000          19  Role19
9  20  Employee20         IT 2020-01-20   69000          20  Role20

   Years_of_Experience
0                    1
1                    2
2                    3
3                    4
4                    5
5                    6
6                    7
7                    8
8                    9
9                   10

##### 2. Write a line of code to perform an outer join of df1 and df2 on the ‘ID’ column.

Note: The merge() function with how='outer' is useful for combining two DataFrames based on a common column, and keeping all rows from both DataFrames.

In [136]:
# Run DataFrame creation function
outer_join_df = pd.merge(df1, df2, left_on='ID', right_on='Identifier', how='outer')

print(outer_join_df)

      ID        Name Department Start_Date   Salary  Identifier    Role  \
0    1.0   Employee1      Sales 2020-01-01  50000.0         NaN     NaN
1    2.0   Employee2  Marketing 2020-01-02  51000.0         NaN     NaN
2    3.0   Employee3         HR 2020-01-03  52000.0         NaN     NaN
3    4.0   Employee4      Sales 2020-01-04  53000.0         NaN     NaN
4    5.0   Employee5         IT 2020-01-05  54000.0         NaN     NaN
5    6.0   Employee6  Marketing 2020-01-06  55000.0         NaN     NaN
6    7.0   Employee7         HR 2020-01-07  56000.0         NaN     NaN
7    8.0   Employee8         IT 2020-01-08  57000.0         NaN     NaN
8    9.0   Employee9      Sales 2020-01-09  58000.0         NaN     NaN
9   10.0  Employee10  Marketing 2020-01-10  59000.0         NaN     NaN
10  11.0  Employee11         HR 2020-01-11  60000.0        11.0  Role11
11  12.0  Employee12         IT 2020-01-12  61000.0        12.0  Role12
12  13.0  Employee13      Sales 2020-01-13  62000.0        13.0  Role13
13  14.0  Employee14  Marketing 2020-01-14  63000.0        14.0  Role14
14  15.0  Employee15         HR 2020-01-15  64000.0        15.0  Role15
15  16.0  Employee16         IT 2020-01-16  65000.0        16.0  Role16
16  17.0  Employee17      Sales 2020-01-17  66000.0        17.0  Role17
17  18.0  Employee18  Marketing 2020-01-18  67000.0        18.0  Role18
18  19.0  Employee19         HR 2020-01-19  68000.0        19.0  Role19
19  20.0  Employee20         IT 2020-01-20  69000.0        20.0  Role20
20   NaN         NaN        NaN        NaT      NaN        21.0  Role21
21   NaN         NaN        NaN        NaT      NaN        22.0  Role22
22   NaN         NaN        NaN        NaT      NaN        23.0  Role23
23   NaN         NaN        NaN        NaT      NaN        24.0  Role24
24   NaN         NaN        NaN        NaT      NaN        25.0  Role25
25   NaN         NaN        NaN        NaT      NaN        26.0  Role26
26   NaN         NaN        NaN        NaT      NaN        27.0  Role27
27   NaN         NaN        NaN        NaT      NaN        28.0  Role28
28   NaN         NaN        NaN        NaT      NaN        29.0  Role29
29   NaN         NaN        NaN        NaT      NaN        30.0  Role30

    Years_of_Experience
0                   NaN
1                   NaN
2                   NaN
3                   NaN
4                   NaN
5                   NaN
6                   NaN
7                   NaN
8                   NaN
9                   NaN
10                  1.0
11                  2.0
12                  3.0
13                  4.0
14                  5.0
15                  6.0
16                  7.0
17                  8.0
18                  9.0
19                 10.0
20                 11.0
21                 12.0
22                 13.0
23                 14.0
24                 15.0
25                 16.0
26                 17.0
27                 18.0
28                 19.0
29                 20.0

##### 3. Write a line of code to join df1 and df2 on different column names (‘ID’ in df1 and ‘Identifier’ in df2).

Note: The merge() function with left_on and right_on parameters is useful for combining two DataFrames based on different column names.

In [137]:
# Run DataFrame creation function
joined_df = pd.merge(df1, df2, left_on='ID', right_on='Identifier')

print(joined_df)

   ID        Name Department Start_Date  Salary  Identifier    Role  \
0  11  Employee11         HR 2020-01-11   60000          11  Role11
1  12  Employee12         IT 2020-01-12   61000          12  Role12
2  13  Employee13      Sales 2020-01-13   62000          13  Role13
3  14  Employee14  Marketing 2020-01-14   63000          14  Role14
4  15  Employee15         HR 2020-01-15   64000          15  Role15
5  16  Employee16         IT 2020-01-16   65000          16  Role16
6  17  Employee17      Sales 2020-01-17   66000          17  Role17
7  18  Employee18  Marketing 2020-01-18   67000          18  Role18
8  19  Employee19         HR 2020-01-19   68000          19  Role19
9  20  Employee20         IT 2020-01-20   69000          20  Role20

   Years_of_Experience
0                    1
1                    2
2                    3
3                    4
4                    5
5                    6
6                    7
7                    8
8                    9
9                   10

##### 4. Write a line of code to join df1 and df2 on their indices.

Note: The join() function is useful for combining two DataFrames based on their indices.

In [132]:
# Run DataFrame creation function
joined_df = df1.join(df2)

print(joined_df)

    ID        Name Department Start_Date  Salary  Identifier    Role  \
0    1   Employee1      Sales 2020-01-01   50000          11  Role11
1    2   Employee2  Marketing 2020-01-02   51000          12  Role12
2    3   Employee3         HR 2020-01-03   52000          13  Role13
3    4   Employee4      Sales 2020-01-04   53000          14  Role14
4    5   Employee5         IT 2020-01-05   54000          15  Role15
5    6   Employee6  Marketing 2020-01-06   55000          16  Role16
6    7   Employee7         HR 2020-01-07   56000          17  Role17
7    8   Employee8         IT 2020-01-08   57000          18  Role18
8    9   Employee9      Sales 2020-01-09   58000          19  Role19
9   10  Employee10  Marketing 2020-01-10   59000          20  Role20
10  11  Employee11         HR 2020-01-11   60000          21  Role21
11  12  Employee12         IT 2020-01-12   61000          22  Role22
12  13  Employee13      Sales 2020-01-13   62000          23  Role23
13  14  Employee14  Marketing 2020-01-14   63000          24  Role24
14  15  Employee15         HR 2020-01-15   64000          25  Role25
15  16  Employee16         IT 2020-01-16   65000          26  Role26
16  17  Employee17      Sales 2020-01-17   66000          27  Role27
17  18  Employee18  Marketing 2020-01-18   67000          28  Role28
18  19  Employee19         HR 2020-01-19   68000          29  Role29
19  20  Employee20         IT 2020-01-20   69000          30  Role30

    Years_of_Experience
0                     1
1                     2
2                     3
3                     4
4                     5
5                     6
6                     7
7                     8
8                     9
9                    10
10                   11
11                   12
12                   13
13                   14
14                   15
15                   16
16                   17
17                   18
18                   19
19                   20

##### 5. Write a line of code to perform a left join of df1 and df2 on the ‘ID’ column.

Note: The merge() function with how='left' is useful for combining two DataFrames based on a common column, and keeping all rows from the left DataFrame.

In [151]:
# Run DataFrame creation function
import pandas as pd 

left_join_df = pd.merge(df1,df2,left_on='ID',right_on='Identifier', how='left')

print(left_join_df)

    ID        Name Department Start_Date  Salary  Identifier    Role  \
0    1   Employee1      Sales 2020-01-01   50000         NaN     NaN
1    2   Employee2  Marketing 2020-01-02   51000         NaN     NaN
2    3   Employee3         HR 2020-01-03   52000         NaN     NaN
3    4   Employee4      Sales 2020-01-04   53000         NaN     NaN
4    5   Employee5         IT 2020-01-05   54000         NaN     NaN
5    6   Employee6  Marketing 2020-01-06   55000         NaN     NaN
6    7   Employee7         HR 2020-01-07   56000         NaN     NaN
7    8   Employee8         IT 2020-01-08   57000         NaN     NaN
8    9   Employee9      Sales 2020-01-09   58000         NaN     NaN
9   10  Employee10  Marketing 2020-01-10   59000         NaN     NaN
10  11  Employee11         HR 2020-01-11   60000        11.0  Role11
11  12  Employee12         IT 2020-01-12   61000        12.0  Role12
12  13  Employee13      Sales 2020-01-13   62000        13.0  Role13
13  14  Employee14  Marketing 2020-01-14   63000        14.0  Role14
14  15  Employee15         HR 2020-01-15   64000        15.0  Role15
15  16  Employee16         IT 2020-01-16   65000        16.0  Role16
16  17  Employee17      Sales 2020-01-17   66000        17.0  Role17
17  18  Employee18  Marketing 2020-01-18   67000        18.0  Role18
18  19  Employee19         HR 2020-01-19   68000        19.0  Role19
19  20  Employee20         IT 2020-01-20   69000        20.0  Role20

    Years_of_Experience
0                   NaN
1                   NaN
2                   NaN
3                   NaN
4                   NaN
5                   NaN
6                   NaN
7                   NaN
8                   NaN
9                   NaN
10                  1.0
11                  2.0
12                  3.0
13                  4.0
14                  5.0
15                  6.0
16                  7.0
17                  8.0
18                  9.0
19                 10.0

##### 6. Write a line of code to perform a right join of df1 and df2 on the ‘ID’ column.

Note: The merge() function with how='right' is useful for combining two DataFrames based on a common column, and keeping all rows from the right DataFrame.

In [153]:
# Run DataFrame creation function
right_join_df = pd.merge(df1, df2, left_on='ID',right_on="Identifier", how='right')

print(right_join_df)

      ID        Name Department Start_Date   Salary  Identifier    Role  \
0   11.0  Employee11         HR 2020-01-11  60000.0          11  Role11
1   12.0  Employee12         IT 2020-01-12  61000.0          12  Role12
2   13.0  Employee13      Sales 2020-01-13  62000.0          13  Role13
3   14.0  Employee14  Marketing 2020-01-14  63000.0          14  Role14
4   15.0  Employee15         HR 2020-01-15  64000.0          15  Role15
5   16.0  Employee16         IT 2020-01-16  65000.0          16  Role16
6   17.0  Employee17      Sales 2020-01-17  66000.0          17  Role17
7   18.0  Employee18  Marketing 2020-01-18  67000.0          18  Role18
8   19.0  Employee19         HR 2020-01-19  68000.0          19  Role19
9   20.0  Employee20         IT 2020-01-20  69000.0          20  Role20
10   NaN         NaN        NaN        NaT      NaN          21  Role21
11   NaN         NaN        NaN        NaT      NaN          22  Role22
12   NaN         NaN        NaN        NaT      NaN          23  Role23
13   NaN         NaN        NaN        NaT      NaN          24  Role24
14   NaN         NaN        NaN        NaT      NaN          25  Role25
15   NaN         NaN        NaN        NaT      NaN          26  Role26
16   NaN         NaN        NaN        NaT      NaN          27  Role27
17   NaN         NaN        NaN        NaT      NaN          28  Role28
18   NaN         NaN        NaN        NaT      NaN          29  Role29
19   NaN         NaN        NaN        NaT      NaN          30  Role30

    Years_of_Experience
0                     1
1                     2
2                     3
3                     4
4                     5
5                     6
6                     7
7                     8
8                     9
9                    10
10                   11
11                   12
12                   13
13                   14
14                   15
15                   16
16                   17
17                   18
18                   19
19                   20

##### 7. Write a line of code to join df1 and df2 on the ‘ID’ column, where ‘ID’ is the index in df1 and a regular column in df2.

Note: The combination of the .set_index() function and the .join() function is useful when you want to join two DataFrames based on an index in one DataFrame and a regular column in another DataFrame.

In [161]:
# Run DataFrame creation function
joined_df = df1.set_index('ID').join(df2)

print(joined_df)

          Name Department Start_Date  Salary  Identifier    Role  \
ID
1    Employee1      Sales 2020-01-01   50000        12.0  Role12
2    Employee2  Marketing 2020-01-02   51000        13.0  Role13
3    Employee3         HR 2020-01-03   52000        14.0  Role14
4    Employee4      Sales 2020-01-04   53000        15.0  Role15
5    Employee5         IT 2020-01-05   54000        16.0  Role16
6    Employee6  Marketing 2020-01-06   55000        17.0  Role17
7    Employee7         HR 2020-01-07   56000        18.0  Role18
8    Employee8         IT 2020-01-08   57000        19.0  Role19
9    Employee9      Sales 2020-01-09   58000        20.0  Role20
10  Employee10  Marketing 2020-01-10   59000        21.0  Role21
11  Employee11         HR 2020-01-11   60000        22.0  Role22
12  Employee12         IT 2020-01-12   61000        23.0  Role23
13  Employee13      Sales 2020-01-13   62000        24.0  Role24
14  Employee14  Marketing 2020-01-14   63000        25.0  Role25
15  Employee15         HR 2020-01-15   64000        26.0  Role26
16  Employee16         IT 2020-01-16   65000        27.0  Role27
17  Employee17      Sales 2020-01-17   66000        28.0  Role28
18  Employee18  Marketing 2020-01-18   67000        29.0  Role29
19  Employee19         HR 2020-01-19   68000        30.0  Role30
20  Employee20         IT 2020-01-20   69000         NaN     NaN

    Years_of_Experience
ID
1                   2.0
2                   3.0
3                   4.0
4                   5.0
5                   6.0
6                   7.0
7                   8.0
8                   9.0
9                  10.0
10                 11.0
11                 12.0
12                 13.0
13                 14.0
14                 15.0
15                 16.0
16                 17.0
17                 18.0
18                 19.0
19                 20.0
20                  NaN

##### 8. Write a line of code to join df1 and df2, where ‘ID’ is a regular column in both DataFrames, but treat it as an index only for the purpose of joining.

Note: The combination of the .set_index(), .join(), and .reset_index() functions is useful when you want to join two DataFrames based on a common column, but don’t want this column to be the index in your resulting DataFrame.

In [164]:
# Run DataFrame creation function
joined_df = df1.set_index('ID').join(df2.set_index('Identifier')).reset_index()

print(joined_df)

    ID        Name Department Start_Date  Salary    Role  Years_of_Experience
0    1   Employee1      Sales 2020-01-01   50000     NaN                  NaN
1    2   Employee2  Marketing 2020-01-02   51000     NaN                  NaN
2    3   Employee3         HR 2020-01-03   52000     NaN                  NaN
3    4   Employee4      Sales 2020-01-04   53000     NaN                  NaN
4    5   Employee5         IT 2020-01-05   54000     NaN                  NaN
5    6   Employee6  Marketing 2020-01-06   55000     NaN                  NaN
6    7   Employee7         HR 2020-01-07   56000     NaN                  NaN
7    8   Employee8         IT 2020-01-08   57000     NaN                  NaN
8    9   Employee9      Sales 2020-01-09   58000     NaN                  NaN
9   10  Employee10  Marketing 2020-01-10   59000     NaN                  NaN
10  11  Employee11         HR 2020-01-11   60000  Role11                  1.0
11  12  Employee12         IT 2020-01-12   61000  Role12                  2.0
12  13  Employee13      Sales 2020-01-13   62000  Role13                  3.0
13  14  Employee14  Marketing 2020-01-14   63000  Role14                  4.0
14  15  Employee15         HR 2020-01-15   64000  Role15                  5.0
15  16  Employee16         IT 2020-01-16   65000  Role16                  6.0
16  17  Employee17      Sales 2020-01-17   66000  Role17                  7.0
17  18  Employee18  Marketing 2020-01-18   67000  Role18                  8.0
18  19  Employee19         HR 2020-01-19   68000  Role19                  9.0
19  20  Employee20         IT 2020-01-20   69000  Role20                 10.0